// Validation errors messages for Parsley
// Load this after Parsley

Parsley.addMessages('en', {
  dateiso:  "সঠিক তারিখ উল্লেখ করুন। (YYYY-MM-DD).",
  date: "%s ফরমেটে উল্লেখিতভাবে তারিখ প্রদান করুন।",
  datebeforenow: "%s ফরমেটে আজকের পূর্বের তারিখ প্রদান করুন।",
  dateafternow: "%s ফরমেটে আজকের পরের তারিখ প্রদান করুন।",
  minwords: "তথ্যটি খুবই ছোট। এতে কমপক্ষে %sটি বা তার চেয়ে বেশি শব্দ থাকা উচিত।",
  maxwords: "তথ্যটি খুবই বড়। এতে কমপক্ষে %sটি বা তার চেয়ে কম শব্দ থাকা উচিত।",
  words:    "প্রদত্ত তথ্যটি ভুল। এতে %s থেকে %sটি শব্দ থাকা উচিত।",
  gt:       "প্রদত্ত তথ্যটি %s এর বেশি অক্ষরের হওয়া উচিত।",
  gte:      "প্রদত্ত তথ্যটি %s এর সমান বা বেশি হওয়া উচিত।",
  lt:       "প্রদত্ত তথ্যটি %s এর কম হওয়া উচিত",
  lte:      "প্রদত্ত তথ্যটি %s এর সমান বা কম হওয়া উচিত।",
  notequalto: "প্রদত্ত তথ্যটি %s সাথে যেন মিল না থাকে।"
});
