// Validation errors messages for Parsley
// Load this after Parsley

Parsley.addMessages('bn', {
  defaultMessage: "প্রদত্ত তথ্যটি ভুল প্রতিয়মান হচ্ছে।",
  type: {
    email:        "সঠিক ইমেইল ঠিকানা প্রদান করুন।",
    url:          "সঠিক ওয়েব ঠিকানা প্রদান করুন।",
    number:       "সঠিক সংখ্যা প্রদান করুন।",
    integer:      "সঠিক পূর্ণসংখ্যা প্রদান করুন।",
    digits:       "সঠিক সংখ্যা প্রদান করুন।",
    alphanum:     "প্রদত্ত তথ্যে শুধুমাত্র বর্ণ বা সংখ্যা থাকতে পারবে।"
  },
  notblank:       "তথ্য খালি থাকতে পারবে না।",
  required:       "তথ্যটি দেওয়া প্রয়োজনীয়।",
  pattern:        "প্রদত্ত তথ্যটি ভুল প্রতিয়মান হচ্ছে।",
  min:            "প্রদত্ত সংখ্যাটি %s বা বড় সংখ্যা হতে হবে।",
  max:            "প্রদত্ত সংখ্যাটি %s বা ছোট সংখ্যা হতে হবে।",
  range:          "প্রদত্ত সংখ্যাটি %s এবং %s এর মধ্যে হতে হবে।",
  minlength:      "প্রদত্ত তথ্যটি খুবই ছোট। এতে কমপক্ষে %sটি বা বেশি অক্ষর থাকতে হবে।",
  maxlength:      "প্রদত্ত তথ্যটি খুবই বড়। এতে %sটি বা কম অক্ষর থাকতে হবে।",
  length:         "প্রদত্ত তথ্যের দৈর্ঘ্য ভুল। এটি %s এবং %s অক্ষরের ভিতরে হতে হবে।",
  mincheck:       "কমপক্ষে %sটি তথ্য নির্বাচন করতে হবে।",
  maxcheck:       "কমপক্ষে %sটি বা তার চাইতে কম তথ্য নির্বাচন করতে হবে।",
  check:          "%s থেকে %sটির মধ্যে তথ্য নির্বাচন করতে হবে।.",
  equalto:        "তথ্যটি অনুরূপ হতে হবে।",
  euvatin:        "এটি বৈধ ভ্যাট সনাক্তকরণ নম্বর নয়।",
});

Parsley.setLocale('en');
